src/InformationRegisters/ГруппыСчетчиковФормаСписка/ГруппыСчетчиковФормаСписка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГруппыСчетчиковФормаСписка</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Счетчик</name>
    <type>
      <types>CatalogRef.ГруппыСчетчиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификаторФормы</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ГруппыСчетчиковФормаСписка/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция УдалитьУстаревшиеДанные() Экспорт
	
	ЕстьУдаление = Ложь;
	
	ТекДата = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УникальныйИдентификаторФормы
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 10000
	|		УникальныйИдентификаторФормы
	|	ИЗ
	|		РегистрСведений.ГруппыСчетчиковФормаСписка
	|	ГДЕ
	|		Период < &ГраницаУдаления
	|	) КАК Выборка
	|";
	
	Запрос.УстановитьПараметр("ГраницаУдаления", НачалоДня(ТекДата) - 86400);
		
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	НаборЗаписей = РегистрыСведений.ГруппыСчетчиковФормаСписка.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		ЕстьУдаление = Истина;
		НаборЗаписей.Отбор.УникальныйИдентификаторФормы.Установить(Выборка.УникальныйИдентификаторФормы);
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
		
	Возврат ЕстьУдаление;
	
КонецФункции

Функция УдалитьСчетчик(Счетчик) Экспорт
    
    НаборЗаписей = РегистрыСведений.ГруппыСчетчиковФормаСписка.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Счетчик.Установить(Счетчик);
    НаборЗаписей.Записать(Истина);
    
КонецФункции

#КонецЕсли
